; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_60)

(:domain logistics)

(:objects
	obj0 obj3 - airport
	obj1 obj4 - city
	obj2 obj6 obj7 obj8 - truck
	obj5 obj16 - location
	obj9 obj10 obj11 obj12 obj13 obj14 - package
	obj15 - airplane
)

(:init
	(at obj2 obj0)
	(at obj6 obj3)
	(at obj7 obj0)
	(at obj8 obj0)
	(at obj9 obj3)
	(at obj10 obj0)
	(at obj11 obj0)
	(at obj12 obj3)
	(at obj13 obj0)
	(at obj14 obj0)
	(at obj15 obj0)
	(in-city obj0 obj1)
	(in-city obj3 obj4)
	(in-city obj5 obj4)
	(in-city obj16 obj1)
)

(:goal (and
	(at obj9 obj16)
	(at obj10 obj5)
	(at obj11 obj5)
	(at obj12 obj16)
	(at obj13 obj3)
	(at obj14 obj3)
))
)

; plan
1. (drive obj2 obj0 obj16)
   deleted: (at obj2 obj0)
   added: (at obj2 obj16)
   goals met: 0 of 6
2. (drive obj6 obj3 obj5)
   deleted: (at obj6 obj3)
   added: (at obj6 obj5)
   goals met: 0 of 6
3. (drive obj8 obj0 obj16)
   deleted: (at obj8 obj0)
   added: (at obj8 obj16)
   goals met: 0 of 6
4. (load obj15 obj10 obj0)
   deleted: (at obj10 obj0)
   added: (in obj10 obj15)
   goals met: 0 of 6
5. (load obj15 obj11 obj0)
   deleted: (at obj11 obj0)
   added: (in obj11 obj15)
   goals met: 0 of 6
6. (fly obj15 obj0 obj3)
   deleted: (at obj15 obj0)
   added: (at obj15 obj3)
   goals met: 0 of 6
7. (drive obj2 obj16 obj0)
   deleted: (at obj2 obj16)
   added: (at obj2 obj0)
   goals met: 0 of 6
8. (drive obj6 obj5 obj3)
   deleted: (at obj6 obj5)
   added: (at obj6 obj3)
   goals met: 0 of 6
9. (drive obj7 obj0 obj16)
   deleted: (at obj7 obj0)
   added: (at obj7 obj16)
   goals met: 0 of 6
10. (drive obj8 obj16 obj0)
   deleted: (at obj8 obj16)
   added: (at obj8 obj0)
   goals met: 0 of 6
11. (load obj15 obj12 obj3)
   deleted: (at obj12 obj3)
   added: (in obj12 obj15)
   goals met: 0 of 6
12. (load obj15 obj9 obj3)
   deleted: (at obj9 obj3)
   added: (in obj9 obj15)
   goals met: 0 of 6
13. (unload obj15 obj10 obj3)
   deleted: (in obj10 obj15)
   added: (at obj10 obj3)
   goals met: 0 of 6
14. (unload obj15 obj11 obj3)
   deleted: (in obj11 obj15)
   added: (at obj11 obj3)
   goals met: 0 of 6
15. (fly obj15 obj3 obj0)
   deleted: (at obj15 obj3)
   added: (at obj15 obj0)
   goals met: 0 of 6
16. (drive obj7 obj16 obj0)
   deleted: (at obj7 obj16)
   added: (at obj7 obj0)
   goals met: 0 of 6
17. (unload obj15 obj12 obj0)
   deleted: (in obj12 obj15)
   added: (at obj12 obj0)
   goals met: 0 of 6
18. (unload obj15 obj9 obj0)
   deleted: (in obj9 obj15)
   added: (at obj9 obj0)
   goals met: 0 of 6
19. (drive obj7 obj0 obj16)
   deleted: (at obj7 obj0)
   added: (at obj7 obj16)
   goals met: 0 of 6
20. (drive obj8 obj0 obj16)
   deleted: (at obj8 obj0)
   added: (at obj8 obj16)
   goals met: 0 of 6
21. (load obj15 obj13 obj0)
   deleted: (at obj13 obj0)
   added: (in obj13 obj15)
   goals met: 0 of 6
22. (load obj15 obj14 obj0)
   deleted: (at obj14 obj0)
   added: (in obj14 obj15)
   goals met: 0 of 6
23. (load obj2 obj12 obj0)
   deleted: (at obj12 obj0)
   added: (in obj12 obj2)
   goals met: 0 of 6
24. (load obj2 obj9 obj0)
   deleted: (at obj9 obj0)
   added: (in obj9 obj2)
   goals met: 0 of 6
25. (load obj6 obj10 obj3)
   deleted: (at obj10 obj3)
   added: (in obj10 obj6)
   goals met: 0 of 6
26. (load obj6 obj11 obj3)
   deleted: (at obj11 obj3)
   added: (in obj11 obj6)
   goals met: 0 of 6
27. (drive obj2 obj0 obj16)
   deleted: (at obj2 obj0)
   added: (at obj2 obj16)
   goals met: 0 of 6
28. (drive obj6 obj3 obj5)
   deleted: (at obj6 obj3)
   added: (at obj6 obj5)
   goals met: 0 of 6
29. (fly obj15 obj0 obj3)
   deleted: (at obj15 obj0)
   added: (at obj15 obj3)
   goals met: 0 of 6
30. (drive obj7 obj16 obj0)
   deleted: (at obj7 obj16)
   added: (at obj7 obj0)
   goals met: 0 of 6
31. (unload obj15 obj13 obj3)
   deleted: (in obj13 obj15)
   added: (at obj13 obj3)
   goals met: 1 of 6
32. (unload obj15 obj14 obj3)
   deleted: (in obj14 obj15)
   added: (at obj14 obj3)
   goals met: 2 of 6
33. (unload obj2 obj12 obj16)
   deleted: (in obj12 obj2)
   added: (at obj12 obj16)
   goals met: 3 of 6
34. (unload obj2 obj9 obj16)
   deleted: (in obj9 obj2)
   added: (at obj9 obj16)
   goals met: 4 of 6
35. (unload obj6 obj10 obj5)
   deleted: (in obj10 obj6)
   added: (at obj10 obj5)
   goals met: 5 of 6
36. (unload obj6 obj11 obj5)
   deleted: (in obj11 obj6)
   added: (at obj11 obj5)
   goals met: 6 of 6
